<template>
  <section class="about">
    <div class="container">
      <p class="about__text">
        Описание сайта - IQ – это общепринятый стандарт, по которому измеряется
        уровень интеллекта. ВСТАВИТЬ: ЧТО ТАКОЕ УРОВЕНЬ ИНТЕЛЛЕКТА, ДЛЯ КОГО
        ПРЕДНАЗНАЧЕН КОНТЕНТ САЙТА Если вы хотите узнать, насколько вы умны, а
        также пройти тест на IQ, то устраивайтесь поудобнее и вперед! Как только
        вы дадите ответы на 15 вопросов, наша система обработает их и с
        точностью до 1 балла выдаст результат. Интересно, что только 3 % людей
        имеют уровень IQ выше 130 баллов. Среди них, например, Билл Гейтс и
        Арнольд Шварценеггер. Быть может, вы в их числе? Скорее проверьте, ведь
        тест не отнимет у вас слишком много времени! Разноплановые задания
        помогут определить уровень словарного запаса, математические и
        логические способности, умение работать с текстовой информацией. Пройти
        задания могут как дети, так и взрослые в любом возрасте. По крайней
        мере, могут попробовать. Весь комплекс задач разбит на 3 возростные
        группы по 15 вопросов. Сложность в каждом тесте распределяется от
        простого к сложному. В конце вас попросят указать свой возраст. После
        этого на экране появится число, обозначающее уровень интеллекта. Если вы
        набрали 130 и больше баллов, то это очень хороший результат, если от 110
        до 130 – тоже здорово, ведь такой IQ считается выше среднего, а от 90 до
        110 – средний показатель. Разноплановые задания помогут определить
        уровень словарного запаса, математические и логические способности,
        умение работать с текстовой информацией.
      </p>

      <p class="about__text">
        Возростной выбор теста - 7-9 класс (школьник) - 10-11 класс (ШКОЛЬНИК
        продвинутый) - о 20 лет (ВЗРОСЛЫЕ прием на работу) В российских школах
        используют ШТУР — школьный тест умственного развития для учеников 7—9
        классов. Он оценивает уровень эрудиции, способности проводить аналогии,
        классифицировать понятия, обобщать и видеть закономерности.
      </p>

      <p class="about__text">
        Выводы результатов - Ваш IQ: 62 Важно! Ваш результат может быть таким,
        потому что вы закончили тест менее чем за 1 минут. Для получения более
        точных результатов - не торопитесь, сделайте тест внимательно и
        сосредоточьтесь на каждом вопросе. Обычно на выполнение теста требуется
        не менее 15 минут. Средний IQ составляет 100. Около 68% человек имеют
        оценку от 85 до 115. Факторы, влияющие на результат IQ Человек должен
        чувствовать себя хорошо и комфортно во время выполнения теста IQ. Есть
        определенные факторы, которые могут повлиять на оценку IQ и привести к
        более низкому результату: - Сделать тест очень быстро и не вдумчиво -
        Недостаток нужной концентрации на вопросах - Беспокойство, стресс,
        депрессия, дискомфорт - Низкая мотивация - Недостаток сна Так ли важен
        IQ? Это сложный вопрос и зависит от конкретного человека. Оценка IQ
        может быть информативной, но иногда необязательной. Хотя люди с высоким
        IQ обычно хорошо учатся, часто зарабатывают больше денег и в целом имеют
        тенденцию быть более здоровыми, однако показатели IQ не обязательно
        предсказывают успех человека в жизни. Некоторые люди могут хорошо
        справляться в одной области и иметь слабые места в одном или нескольких
        типах интеллекта, но отлично проявить себя в других областях. Эксперты
        предполагают, что успеху в жизни способствуют и другие важные элементы,
        включая социальные и эмоциональные факторы, амбиции, мотивацию,
        возможности. Важно помнить, что тесты на IQ - это только мера
        интеллекта, и большинство людей способны учиться независимо от своего
        показателя IQ. Есть много способов, которые могут помочь человеку
        повысить свой IQ, а также улучшить работу своего мозга, например,
        постоянно изучать что-то новое, часто читать, изучать новые языки,
        физические упражнения, правильное питание и другие занятия.
      </p>
    </div>
  </section>
</template>
