<template>
  <section class="resuls">
    <div class="container">
      <h2 class="resuls__title">
        Ваш IQ:
        {{ ((correctAnswers < 15 ? 16 : correctAnswers + 4) / 20) * 100 }}
      </h2>
      <h3 class="resuls__import" v-if="timer < 2">
        <span>Важно!</span> Ваш результат может быть таким, потому что вы
        закончили тест менее чем за 1 минут. Для получения более точных
        результатов - не торопитесь, сделайте тест внимательно и сосредоточьтесь
        на каждом вопросе. Обычно на выполнение теста требуется не менее 15
        минут.
      </h3>
      <p class="resuls__text">
        Это выше <b>0.4</b> процентов всех результатов.
      </p>
      <p class="resuls__text">
        Средний IQ составляет 100. Около 68% человек имеют оценку от 85 до 115.
      </p>
      <div class="resuls__subtitle">Факторы, влияющие на результат IQ</div>
      <p class="resuls__text">
        Человек должен чувствовать себя хорошо и комфортно во время выполнения
        теста IQ. Есть определенные факторы, которые могут повлиять на оценку IQ
        и привести к более низкому результату:
      </p>
      <ul class="resuls__spisok">
        <li>- Сделать тест очень быстро и не вдумчиво</li>
        <li>- Недостаток нужной концентрации на вопросах</li>
        <li>- Беспокойство, стресс, депрессия, дискомфорт</li>
        <li>- Низкая мотивация</li>
        <li>- Недостаток сна</li>
      </ul>
      <div class="resuls__subtitle">Так ли важен IQ?</div>
      <p class="resuls__text">
        Это сложный вопрос и зависит от конкретного человека. Оценка IQ может
        быть информативной, но иногда необязательной.
      </p>
      <p class="resuls__text">
        Хотя люди с высоким IQ обычно хорошо учатся, часто зарабатывают больше
        денег и в целом имеют тенденцию быть более здоровыми, однако показатели
        IQ не обязательно предсказывают успех человека в жизни. Некоторые люди
        могут хорошо справляться в одной области и иметь слабые места в одном
        или нескольких типах интеллекта, но отлично проявить себя в других
        областях.
      </p>
      <p class="resuls__text">
        Эксперты предполагают, что успеху в жизни способствуют и другие важные
        элементы, включая социальные и эмоциональные факторы, амбиции,
        мотивацию, возможности. Важно помнить, что тесты на IQ - это только мера
        интеллекта, и большинство людей способны учиться независимо от своего
        показателя IQ.
      </p>
      <p class="resuls__text">
        Есть много способов, которые могут помочь человеку повысить свой IQ, а
        также улучшить работу своего мозга, например, постоянно изучать что-то
        новое, часто читать, изучать новые языки, физические упражнения,
        правильное питание и другие занятия.
      </p>
    </div>
  </section>
</template>

<script>
export default {
  data() {
    return {
      correctAnswers: Number(localStorage.getItem("correctAnswers")),
      timer: 20 - Number(localStorage.getItem("timer")),
    };
  },
  mounted() {
    this.correctAnswers == "" ? this.$router.push("/") : "";
  },
};
</script>
